---
kind: method
id: M:Autodesk.Revit.DB.Electrical.AnalyticalDistributionNodePropertyData.Dispose
source: html/f7dfe5ca-7afd-202a-cce0-8d4e0ce3a8fb.htm
---
# Autodesk.Revit.DB.Electrical.AnalyticalDistributionNodePropertyData.Dispose Method

Releases all resources used by the AnalyticalDistributionNodePropertyData

## Syntax (C#)
```csharp
public void Dispose()
```